wiyooo/ESP32S3_Camera_USB_uvc/sdkconfig.defaults
# ESP32-S3, 16 MiB Flash confirmed by the user; no external PSRAM required.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_32B=y

# UART0 diagnostics. Camera video is served after joining the configured router.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# This board has no PSRAM. Keep enough internal RAM for the RGB565 camera frame,
# reusable JPEG buffer, HTTP server and one MJPEG client.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=2
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=8
CONFIG_ESP_WIFI_TX_BA_WIN=4
CONFIG_ESP_WIFI_RX_BA_WIN=4
CONFIG_LWIP_MAX_SOCKETS=6
CONFIG_LWIP_MAX_ACTIVE_TCP=4
CONFIG_LWIP_MAX_LISTENING_TCP=2
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=8

# Camera owns SCCB; no LCD, IO expander, IMU or audio drivers.
CONFIG_SCCB_HARDWARE_I2C_DRIVER_LEGACY=y
CONFIG_SCCB_HARDWARE_I2C_PORT0=y
CONFIG_SCCB_CLK_FREQ=100000
CONFIG_GC2145_SUPPORT=y
CONFIG_OV7670_SUPPORT=n
CONFIG_OV7725_SUPPORT=n
CONFIG_NT99141_SUPPORT=n
CONFIG_OV2640_SUPPORT=n
CONFIG_OV3660_SUPPORT=n
CONFIG_OV5640_SUPPORT=n
CONFIG_GC032A_SUPPORT=n
CONFIG_GC0308_SUPPORT=n
CONFIG_BF3005_SUPPORT=n
CONFIG_BF20A6_SUPPORT=n
CONFIG_SC101IOT_SUPPORT=n
CONFIG_SC030IOT_SUPPORT=n
CONFIG_SC031GS_SUPPORT=n
CONFIG_HM1055_SUPPORT=n
CONFIG_HM0360_SUPPORT=n
CONFIG_MEGA_CCM_SUPPORT=n
CONFIG_GC_SENSOR_SUBSAMPLE_MODE=y
CONFIG_CAMERA_PSRAM_DMA=n
CONFIG_CAMERA_CORE0=y

# Retained for the disabled USB UVC output. Set CAMERA_OUTPUT_USB_UVC to 1
# in main/esp32_s3_szp.h when switching the application entry back to UVC.
CONFIG_TINYUSB_RHPORT_FS=y
CONFIG_FORMAT_MJPEG_CAM1=y
CONFIG_UVC_MODE_BULK_CAM1=y
CONFIG_FRAMESIZE_QVGA=y
CONFIG_UVC_CAM1_FRAMERATE=20
CONFIG_UVC_CAM1_MULTI_FRAMESIZE=n
CONFIG_UVC_SUPPORT_TWO_CAM=n
CONFIG_UVC_TINYUSB_TASK_CORE=0
CONFIG_UVC_CAM1_TASK_CORE=1
CONFIG_TUSB_MANUFACTURER="LCSC"
CONFIG_TUSB_PRODUCT="ESP32-S3 GC2145 Camera"
